       identification division.
       program-id. HelloWorld.
       author. Yannick.

       procedure division. 
           
           display "Hello World".

           stop run.


       